hotelReservation/results/client_load_sweeps/20260331T192714Z_recommendations/logs/wrk_recommendations_14000.log
Running 2m test @ http://c220g1-030826.wisc.cloudlab.us:5000
  4 threads and 128 connections

  Thread calibration: mean lat.: 2.287ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.401ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.391ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.274ms, rate sampling interval: 10ms

-----------------------------------------------------------------------
Test Results @ http://c220g1-030826.wisc.cloudlab.us:5000 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     2.36ms    1.18ms   6.57ms   77.26%
    Req/Sec     3.69k   711.64     5.50k    70.25%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.12ms
 75.000%    2.82ms
 90.000%    3.78ms
 99.000%    6.57ms
 99.900%    9.77ms
 99.990%   13.77ms
 99.999%   18.61ms
100.000%   22.48ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.586     0.000000            1         1.00
       1.169     0.100000       154208         1.11
       1.454     0.200000       308144         1.25
       1.689     0.300000       462195         1.43
       1.900     0.400000       616281         1.67
       2.115     0.500000       771437         2.00
       2.227     0.550000       847664         2.22
       2.349     0.600000       924734         2.50
       2.483     0.650000      1001937         2.86
       2.635     0.700000      1078776         3.33
       2.815     0.750000      1155561         4.00
       2.921     0.775000      1194010         4.44
       3.041     0.800000      1232620         5.00
       3.177     0.825000      1271149         5.71
       3.339     0.850000      1309683         6.67
       3.533     0.875000      1348171         8.00
       3.649     0.887500      1367293         8.89
       3.783     0.900000      1386693        10.00
       3.937     0.912500      1405877        11.43
       4.115     0.925000      1425142        13.33
       4.327     0.937500      1444384        16.00
       4.451     0.943750      1454089        17.78
       4.587     0.950000      1463581        20.00
       4.747     0.956250      1473359        22.86
       4.923     0.962500      1482785        26.67
       5.147     0.968750      1492469        32.00
       5.279     0.971875      1497313        35.56
       5.423     0.975000      1502138        40.00
       5.587     0.978125      1506904        45.71
       5.783     0.981250      1511729        53.33
       6.011     0.984375      1516546        64.00
       6.143     0.985938      1518939        71.11
       6.291     0.987500      1521330        80.00
       6.455     0.989062      1523700        91.43
       6.655     0.990625      1526121       106.67
       6.895     0.992188      1528540       128.00
       7.035     0.992969      1529727       142.22
       7.187     0.993750      1530932       160.00
       7.371     0.994531      1532132       182.86
       7.571     0.995313      1533339       213.33
       7.819     0.996094      1534537       256.00
       7.963     0.996484      1535149       284.44
       8.131     0.996875      1535738       320.00
       8.327     0.997266      1536359       365.71
       8.535     0.997656      1536941       426.67
       8.783     0.998047      1537550       512.00
       8.951     0.998242      1537844       568.89
       9.119     0.998437      1538146       640.00
       9.327     0.998633      1538449       731.43
       9.543     0.998828      1538756       853.33
       9.807     0.999023      1539050      1024.00
       9.959     0.999121      1539201      1137.78
      10.135     0.999219      1539348      1280.00
      10.343     0.999316      1539496      1462.86
      10.591     0.999414      1539652      1706.67
      10.919     0.999512      1539799      2048.00
      11.103     0.999561      1539877      2275.56
      11.327     0.999609      1539950      2560.00
      11.535     0.999658      1540023      2925.71
      11.831     0.999707      1540098      3413.33
      12.087     0.999756      1540173      4096.00
      12.247     0.999780      1540213      4551.11
      12.431     0.999805      1540252      5120.00
      12.695     0.999829      1540287      5851.43
      13.007     0.999854      1540326      6826.67
      13.359     0.999878      1540361      8192.00
      13.551     0.999890      1540380      9102.22
      13.823     0.999902      1540399     10240.00
      14.191     0.999915      1540420     11702.86
      14.463     0.999927      1540437     13653.33
      14.799     0.999939      1540455     16384.00
      15.007     0.999945      1540465     18204.44
      15.327     0.999951      1540475     20480.00
      15.527     0.999957      1540484     23405.71
      15.743     0.999963      1540493     27306.67
      16.111     0.999969      1540502     32768.00
      16.311     0.999973      1540507     36408.89
      16.415     0.999976      1540512     40960.00
      16.863     0.999979      1540517     46811.43
      17.359     0.999982      1540521     54613.33
      17.775     0.999985      1540526     65536.00
      17.903     0.999986      1540528     72817.78
      18.415     0.999988      1540531     81920.00
      18.575     0.999989      1540533     93622.86
      18.687     0.999991      1540535    109226.67
      19.343     0.999992      1540538    131072.00
      19.391     0.999993      1540539    145635.56
      19.519     0.999994      1540540    163840.00
      19.695     0.999995      1540541    187245.71
      19.743     0.999995      1540542    218453.33
      20.063     0.999996      1540544    262144.00
      20.063     0.999997      1540544    291271.11
      20.111     0.999997      1540545    327680.00
      20.111     0.999997      1540545    374491.43
      20.655     0.999998      1540546    436906.67
      21.279     0.999998      1540547    524288.00
      21.279     0.999998      1540547    582542.22
      21.279     0.999998      1540547    655360.00
      21.279     0.999999      1540547    748982.86
      21.919     0.999999      1540548    873813.33
      21.919     0.999999      1540548   1048576.00
      21.919     0.999999      1540548   1165084.44
      21.919     0.999999      1540548   1310720.00
      21.919     0.999999      1540548   1497965.71
      22.479     0.999999      1540549   1747626.67
      22.479     1.000000      1540549          inf
#[Mean    =        2.359, StdDeviation   =        1.179]
#[Max     =       22.464, Total count    =      1540549]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  1673972 requests in 2.00m, 0.92GB read
Requests/sec:  13949.86  
Transfer/sec:      7.82MB