hotelReservation/results/client_load_sweeps/20260331T192714Z_recommendations/logs/wrk_recommendations_15000.log
Running 2m test @ http://c220g1-030826.wisc.cloudlab.us:5000
  4 threads and 128 connections

  Thread calibration: mean lat.: 2.883ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.885ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.881ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.863ms, rate sampling interval: 10ms

-----------------------------------------------------------------------
Test Results @ http://c220g1-030826.wisc.cloudlab.us:5000 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     2.80ms    1.46ms   8.09ms   78.70%
    Req/Sec     3.96k   746.91     5.80k    69.11%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.46ms
 75.000%    3.33ms
 90.000%    4.59ms
 99.000%    8.09ms
 99.900%   12.03ms
 99.990%   16.33ms
 99.999%   20.17ms
100.000%   24.98ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.561     0.000000            1         1.00
       1.386     0.100000       165261         1.11
       1.716     0.200000       330522         1.25
       1.974     0.300000       495486         1.43
       2.213     0.400000       660483         1.67
       2.459     0.500000       825689         2.00
       2.595     0.550000       908281         2.22
       2.743     0.600000       991328         2.50
       2.907     0.650000      1073153         2.86
       3.101     0.700000      1156132         3.33
       3.327     0.750000      1238390         4.00
       3.461     0.775000      1279551         4.44
       3.615     0.800000      1320520         5.00
       3.797     0.825000      1361917         5.71
       4.013     0.850000      1403309         6.67
       4.271     0.875000      1444586         8.00
       4.419     0.887500      1465059         8.89
       4.587     0.900000      1485516        10.00
       4.783     0.912500      1506121        11.43
       5.015     0.925000      1527038        13.33
       5.283     0.937500      1547404        16.00
       5.439     0.943750      1557700        17.78
       5.615     0.950000      1568138        20.00
       5.815     0.956250      1578414        22.86
       6.051     0.962500      1588779        26.67
       6.323     0.968750      1599062        32.00
       6.483     0.971875      1604220        35.56
       6.659     0.975000      1609270        40.00
       6.863     0.978125      1614477        45.71
       7.103     0.981250      1619640        53.33
       7.387     0.984375      1624788        64.00
       7.547     0.985938      1627355        71.11
       7.735     0.987500      1629927        80.00
       7.951     0.989062      1632520        91.43
       8.199     0.990625      1635108       106.67
       8.495     0.992188      1637638       128.00
       8.671     0.992969      1638927       142.22
       8.871     0.993750      1640250       160.00
       9.103     0.994531      1641545       182.86
       9.359     0.995313      1642799       213.33
       9.663     0.996094      1644107       256.00
       9.839     0.996484      1644736       284.44
      10.039     0.996875      1645383       320.00
      10.271     0.997266      1646027       365.71
      10.543     0.997656      1646666       426.67
      10.863     0.998047      1647325       512.00
      11.039     0.998242      1647634       568.89
      11.247     0.998437      1647957       640.00
      11.463     0.998633      1648275       731.43
      11.743     0.998828      1648601       853.33
      12.079     0.999023      1648921      1024.00
      12.287     0.999121      1649084      1137.78
      12.535     0.999219      1649244      1280.00
      12.775     0.999316      1649407      1462.86
      13.047     0.999414      1649565      1706.67
      13.367     0.999512      1649726      2048.00
      13.551     0.999561      1649807      2275.56
      13.783     0.999609      1649886      2560.00
      14.031     0.999658      1649968      2925.71
      14.295     0.999707      1650047      3413.33
      14.655     0.999756      1650128      4096.00
      14.863     0.999780      1650168      4551.11
      15.079     0.999805      1650210      5120.00
      15.423     0.999829      1650249      5851.43
      15.663     0.999854      1650289      6826.67
      15.943     0.999878      1650330      8192.00
      16.167     0.999890      1650349      9102.22
      16.399     0.999902      1650370     10240.00
      16.607     0.999915      1650391     11702.86
      16.863     0.999927      1650410     13653.33
      17.199     0.999939      1650431     16384.00
      17.407     0.999945      1650441     18204.44
      17.535     0.999951      1650450     20480.00
      17.759     0.999957      1650461     23405.71
      18.239     0.999963      1650470     27306.67
      18.463     0.999969      1650480     32768.00
      18.607     0.999973      1650485     36408.89
      18.767     0.999976      1650490     40960.00
      18.863     0.999979      1650495     46811.43
      19.119     0.999982      1650500     54613.33
      19.567     0.999985      1650505     65536.00
      19.775     0.999986      1650508     72817.78
      19.983     0.999988      1650510     81920.00
      20.175     0.999989      1650513     93622.86
      20.319     0.999991      1650515    109226.67
      20.735     0.999992      1650518    131072.00
      20.911     0.999993      1650519    145635.56
      20.991     0.999994      1650520    163840.00
      21.455     0.999995      1650522    187245.71
      21.535     0.999995      1650523    218453.33
      22.079     0.999996      1650524    262144.00
      22.479     0.999997      1650525    291271.11
      22.479     0.999997      1650525    327680.00
      23.199     0.999997      1650526    374491.43
      23.215     0.999998      1650527    436906.67
      23.215     0.999998      1650527    524288.00
      23.695     0.999998      1650528    582542.22
      23.695     0.999998      1650528    655360.00
      23.695     0.999999      1650528    748982.86
      24.335     0.999999      1650529    873813.33
      24.335     0.999999      1650529   1048576.00
      24.335     0.999999      1650529   1165084.44
      24.335     0.999999      1650529   1310720.00
      24.335     0.999999      1650529   1497965.71
      24.975     0.999999      1650530   1747626.67
      24.975     1.000000      1650530          inf
#[Mean    =        2.798, StdDeviation   =        1.463]
#[Max     =       24.960, Total count    =      1650530]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  1800906 requests in 2.00m, 0.98GB read
Requests/sec:  15007.61  
Transfer/sec:      8.40MB